Q1. What is the difference between Ordinal Encoding and Label Encoding? Provide an example of when you
might choose one over the other.

#label encoding
order will be not in a same manner

In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
##create a sample dataframe with a catagorical valu
df=pd.DataFrame({
    'colors':['red','blue','green','green','red','blue']
})

In [2]:
df

  colors
0    red
1   blue
2  green
3  green
4    red
5   blue

In [3]:
encoder=LabelEncoder()

In [4]:
encoder.fit_transform(df['colors'])

array([2, 0, 1, 1, 2, 0])

In [5]:
##ordinal encoding

In [6]:
#it when we input the maner or number in serise that the outcome weel br come

In [12]:
from sklearn.preprocessing import OrdinalEncoder
df=pd.DataFrame({
    'colors':['red','blue','green','green','red','blue']
})
##create an instance of the ordinalencoding classnand fit_trans
encoder=OrdinalEncoder(categories=[['red','blue','green']])
encoder.fit_transform(df[['colors']])

array([[0.],
       [1.],
       [2.],
       [2.],
       [0.],
       [1.]])

Q2. Explain how Target Guided Ordinal Encoding works and provide an example of when you might use it in
a machine learning project.

It is a technique used to encord catagorial varial based on there relationship with the targer variable.

In [13]:
import pandas as pd

In [14]:
#create a sample dataframe with a catagorical variabel abd target variabel
df=pd.DataFrame({
    'city':['new_year','london','paris','tykuo','new_year','paris'],
    'price':[200,150,500,250,180,320]
})

In [15]:
df.head()

       city  price
0  new_year    200
1    london    150
2     paris    500
3     tykuo    250
4  new_year    180

In [16]:
#calculate the mean price for city 
mean_price=df.groupby('city')['price'].mean().to_dict()

In [17]:
mean_price

{'london': 150.0, 'new_year': 190.0, 'paris': 410.0, 'tykuo': 250.0}

In [19]:
df['city_encoded']=df['city'].map(mean_price)

In [20]:
df

       city  price  city_encoded
0  new_year    200         190.0
1    london    150         150.0
2     paris    500         410.0
3     tykuo    250         250.0
4  new_year    180         190.0
5     paris    320         410.0

Q3. Define covariance and explain why it is important in statistical analysis. How is covariance calculated?

covariance is a proce relaction between x and y

In [21]:
import seaborn as sns
df=sns.load_dataset('healthexp')
df.head()

   Year        Country  Spending_USD  Life_Expectancy
0  1970        Germany       252.311             70.6
1  1970         France       192.143             72.2
2  1970  Great Britain       123.993             71.9
3  1970          Japan       150.437             72.0
4  1970            USA       326.961             70.9

In [22]:
df.cov()

/tmp/ipykernel_2134/1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

                         Year  Spending_USD  Life_Expectancy
Year               201.098848  2.571883e+04        41.915454
Spending_USD     25718.827373  4.817761e+06      4166.800912
Life_Expectancy     41.915454  4.166801e+03        10.733902

/tmp/ipykernel_2134/1928163937.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr(method='pearson')

                     Year  Spending_USD  Life_Expectancy
Year             1.000000      0.826273         0.902175
Spending_USD     0.826273      1.000000         0.579430
Life_Expectancy  0.902175      0.579430         1.000000

Q6. You are working on a machine learning project with a dataset containing several categorical
variables, including "Gender" (Male/Female), "Education Level" (High School/Bachelor's/Master's/PhD),
and "Employment Status" (Unemployed/Part-Time/Full-Time). Which encoding method would you use for
each variable, and why?